In [21]:
import pandas as pd

In [22]:
df_feature_x = pd.read_csv("EDA.csv", index_col=0)
df_feature_x.head(10)

,Age,Accessibility,EdLevel,Employment,MentalHealth,MainBranch,YearsExp,YearsProExp,PreviousSalary,NumSkills,Employed
0,<35,No,Master,1,No,Dev,7,4,51552,4,0
1,<35,No,Undergraduate,1,No,Dev,12,5,46482,12,1
2,<35,No,Master,1,No,Dev,15,6,77290,7,0
3,<35,No,Undergraduate,1,No,Dev,9,6,46135,13,0
4,>35,No,PhD,0,No,NotDev,40,30,160932,2,0
5,<35,No,Master,1,No,Dev,9,2,38915,5,0
6,>35,No,Master,1,No,Dev,26,18,77831,17,1
7,<35,No,Master,1,No,NotDev,14,5,81319,4,0
8,>35,No,Undergraduate,1,No,Dev,39,21,68507,3,0
9,>35,No,Master,1,No,Dev,20,16,37752,6,0

In [23]:
df_feature_x.drop(columns=["Accessibility", "Employment", "MentalHealth", "MainBranch"], inplace=True)
df_feature_x.head(10)

,Age,EdLevel,YearsExp,YearsProExp,PreviousSalary,NumSkills,Employed
0,<35,Master,7,4,51552,4,0
1,<35,Undergraduate,12,5,46482,12,1
2,<35,Master,15,6,77290,7,0
3,<35,Undergraduate,9,6,46135,13,0
4,>35,PhD,40,30,160932,2,0
5,<35,Master,9,2,38915,5,0
6,>35,Master,26,18,77831,17,1
7,<35,Master,14,5,81319,4,0
8,>35,Undergraduate,39,21,68507,3,0
9,>35,Master,20,16,37752,6,0

In [24]:
df_feature_x["Age"].replace({"<35": 0, ">35": 1}, inplace=True)
df_feature_x["EdLevel"].replace({"NoHigherEd": 1, "Other": 2, "Undergraduate": 3, "Master": 4, "PhD": 5}, inplace=True)
df_feature_x.head(10)

   Age  EdLevel  YearsExp  YearsProExp  PreviousSalary  NumSkills  Employed
0    0        4         7            4           51552          4         0
1    0        3        12            5           46482         12         1
2    0        4        15            6           77290          7         0
3    0        3         9            6           46135         13         0
4    1        5        40           30          160932          2         0
5    0        4         9            2           38915          5         0
6    1        4        26           18           77831         17         1
7    0        4        14            5           81319          4         0
8    1        3        39           21           68507          3         0
9    1        4        20           16           37752          6         0

In [25]:
df_feature_x.to_csv("preprocessing.csv")